Write a solution to find the ids of products that are both low fat and recyclable.

In [26]:
import pandas as pd
df1 = pd.read_excel('C:/Users/Bhao/jupyter data science/Python Course/Python/Python/pandas.xlsx', 'q1')
df1

   product_id   low_fats  recyclable
0             0         Y           N
1             1         Y           Y
2             2         N           Y
3             3         Y           Y
4             4         N           N

In [31]:
df1.columns = df1.columns.str.strip()
df1

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [43]:
res1 = df1[(df1['low_fats'] == 'Y') & (df1['recyclable'] == 'Y')]
res1[['product_id']]

   product_id
1           1
3           3

Write a solution to find the name, population, and area of the big countries.
Country is big if 
-> it has an area of at least three million (i.e., 3000000 km2), or
-> it has a population of at least twenty-five million (i.e., 25000000).

In [57]:
df2 = pd.read_excel('C:/Users/Bhao/jupyter data science/Python Course/Python/Python/pandas.xlsx', 'q2')
df2

           name continent        area  population           gdp
0   Afghanistan         Asia   652230    25500100   20343000000
1  Albania        Europe        28748     2831741   12960000000
2  Algeria        Africa      2381741    37100000  188681000000
3  Andorra        Europe          468       78115    3712000000
4        Angola   Africa      1246700    20609294    3712000000

In [58]:
res2 = df2[(df2['area'] >= 3000000) | (df2['population']>=25000000) ]
res2[['name', 'population', 'area']]

           name  population     area
0   Afghanistan    25500100   652230
2  Algeria         37100000  2381741

From Customers table find out names of those customers who never ordered anything. from Orders table.

In [60]:
# Create Customers DataFrame
customers = {'id': [1, 2, 3, 4],
                  'name': ['Joe', 'Henry', 'Sam', 'Max']}
customers = pd.DataFrame(customers)

# Create Orders DataFrame
orders = {'id': [1, 2],
               'customerId': [3, 1]}
orders = pd.DataFrame(orders)

In [65]:
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [66]:
orders

   id  customerId
0   1           3
1   2           1

In [67]:
# Result should be like this
res = {'Customers': ['Henry', 'Max']}
result = pd.DataFrame(res)
result

  Customers
0     Henry
1       Max

In [61]:
df = pd.merge(customers, orders, how='outer', left_on='id', right_on='customerId')

In [62]:
df1 = df[df['customerId'].isna()]  #extract only null cells 
    # df1 = df[df['customerId'].isnull()]

In [63]:
df1 = df1.rename(columns={'name':'Customers'})   #rename the column

In [64]:
df1['Customers'].to_frame()

  Customers
1     Henry
3       Max